Revit 2022 API
ExporterIFCUtils.CreateProjectLevelGUID Method
 Creates a GUID from Revit project for given GUIDType.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2013
Syntax
C#
[ObsoleteAttribute("This function is deprecated in Revit 2022.  Please see the IFC open source function CreateProjectLevelGUID for examples of how to do this starting in Revit 2022.")]
public static string CreateProjectLevelGUID(
	Document document,
	IFCProjectLevelGUIDType guidType
)
Visual Basic
<ObsoleteAttribute("This function is deprecated in Revit 2022.  Please see the IFC open source function CreateProjectLevelGUID for examples of how to do this starting in Revit 2022.")> _
Public Shared Function CreateProjectLevelGUID ( _
	document As Document, _
	guidType As IFCProjectLevelGUIDType _
) As String
Visual C++
[ObsoleteAttribute(L"This function is deprecated in Revit 2022.  Please see the IFC open source function CreateProjectLevelGUID for examples of how to do this starting in Revit 2022.")]
public:
static String^ CreateProjectLevelGUID(
	Document^ document,
	IFCProjectLevelGUIDType guidType
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
guidType
Type: Autodesk.Revit.DB.IFC.IFCProjectLevelGUIDType
 The GUID type.
Return Value
 The guid string.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace